以太网MAC地址:
	48比特:前24比特是供应商标识,后24比特是供应商对网卡的唯一编号
		对于第8位的数字:0-物理地址(单播地址)
				 1-逻辑地址(组播地址)
以太网帧格式:
	目的地址 源地址 类型/长度 数据 帧效验序列
	  6字节   6字节  2字节    46-1500字节  4字节
交换机的工作模式：
	Switch>用户模式
	Switch>enable 
	Switch#特权模式
	Switch#configure  terminal 
	Switch(config)#全局配置模式
	Switch(config)#interface fastEthernet 0/1    
	Switch(config-if)#接口模式
	exit返回上一模式
	end直接退到特权模式
命令:
	Switch(config)#hostname S1   #修改主机名为S1
	Switch#show  running-config   #查看配置信息
	Switch(config)#enable  password  123 #修改进入密码为123
	Switch# copy  running-config  startup-config或write #保存
	Switch# erase  startup-config #恢复出厂设置
	Switch# reload #重启
	Switch# show mac-address-table #查看MAC地址表
	ctrl + shift +6 #敲错命令卡死时恢复正常

设置工作常用环境
	设备空闲一段时间后回到初始界面
	switch(config)#line con 0
	switch(config-line)#exec-timeout 0 0
	配置输出日志同步(防止有设备出错时打断正在输入的命令行)
	Switch(config)#line console 0
	Switch(config-line)#logging synchronous
	禁用DNS查询(防止命令敲错时出现卡死)
	switch(config)#no ip domain-lookup
VlAN的创建:
	Switch(config)#vlan 2 #创建VLAN2
	Switch(config)#interface range fastEthernet 0/3-4 #同时进入3,4端口
	Switch(config-if-range)#switchport access vlan 2 #把3,4端口加入VLAN2
	Switch#show vlan brief #查看VLAN
多交换机同VLAN
	Switch(config)#interface fastethernet 0/7  #进入交换机1的0/7端口
	Switch(config-if)#switchport access vlan 3  #把交换机1的0/7端口加入VLAN3
	Switch(config)#vlan 3       #在交换机2上创建VLAN3
	Switch(config)#interface range fastEthernet 0/5-7   #进入交换机2的5-7端口
	Switch(config-if-range)#switchport access vlan 3   #把5-7端口加入VLAN3
trunk中继链路
	Switch(config)#interface fastEthernet 0/7 #进入交换机1的0/7端口
	Switch(config-if)#switchport mode trunk #把0/7加入trunk(交换机2与交换机1链接的端口会自动变成trunk)
以太网通道
	Switch(config)#interface range fastEthernet 0/7-9   #进入交换机1的7-9端口
	witch(config-if-range)#channel-group 1 mode on    #把7-9端口捆绑
	Switch(config)#interface range fastEthernet 0/7-9   #进入交换机2的7-9端口
	witch(config-if-range)#channel-group 1 mode on    #把7-9端口捆绑
三层交换机:
   三层交换机的vlan互通
	Switch(config)#interface vlan 1 #进入vlan1
	Switch(config-if)#ip address 192.168.1.254 255.255.255.0 #给vlan1配置IP地址
	Switch(config-if)#no shutdown #开启端口
	Switch(config-if)#vlan 2 #创建vlan2 
	Switch(config-vlan)#vlan 3 #创建vlan3
	Switch(config)#interface vlan 2 #进入vlan2
	Switch(config-if)#ip address 192.168.2.254 255.255.255.0 #给vlan2配置IP地址
	Switch(config-vlan)#exit
	Switch(config)#interface vlan 3 #进入vlan3 
	Switch(config-if)#ip address 192.168.3.254 255.255.255.0 #给vlan3配置IP地址
	Switch(config-vlan)#exit
	Switch(config)#ip routing #开启路由功能
	Switch(config)#interface fastEthernet 0/24 #进入0/24端口
	Switch(config-if)#switchport trunk encapsulation dot1q #封装端口的属性
	Switch(config-if)#switchport mode trunk #把此端口加入trunk
	把2层交换机建立vlan2,vlan3,0/24端口接入3层交换机的0/24,改为trunk
  小型网络
	Switch(config)#interface fastEthernet 0/23
	Swicth(config-if)#no switch
	Switch(config-if)#ip address 192.168.4.1 255.255.255.0
	Swicth(config-if)#exit
	Swicth(config)#ip route 0.0.0.0 0.0.0.0 192.168.4.2
	Router(config)#interface gigabitEthernet 0/0
	Router(config-if)#ip address 192.168.4.2 255.255.255.0
	Router(config-if)#no showdown
`	Router(config-if)#exit
	Router(config-if)#ip route 192.168.1.0 255.255.255.0
	Router(config-if)#no shutdown
	Router(config)#ip route 192.168.1.0 255.255.255.0 192.168.4.1
	Router(config)#ip route 192.168.1.0 255.255.255.0 192.168.4.1
	Router(config)#ip route 192.168.1.0 255.255.255.0 192.168.4.1







